arfei0107/emWin_OSD/Drivers/LPC18xx_43xx.h
typedef struct {                            /*!< (@ 0x4008x000) GPIO_GROUP_INT0 Structure */
  __IO uint32_t CTRL;                       /*!< (@ 0x4008x000) GPIO grouped interrupt control register */
  __I  uint32_t RESERVED0[7];
  __IO uint32_t PORT_POL[8];                /*!< (@ 0x4008x020) GPIO grouped interrupt port polarity register */
  __IO uint32_t PORT_ENA[8];                /*!< (@ 0x4008x040) GPIO grouped interrupt port 0/1 enable register */
} LPC_GPIO_GROUP_INTn_Type;


// ------------------------------------------------------------------------------------------------
// -----                                  Random number generation (RNG)                      -----
// ------------------------------------------------------------------------------------------------

typedef struct
{
  __I	uint32_t RANDOM_NUMBER;     /*!< (@ 0x40054000) Random number */
  __I	uint32_t STATISTIC;         /*!< (@ 0x40054004) Statistic */
  __IO	uint32_t COUNTER_SEL_RNG;   /*!< (@ 0x40054008) Select for statistics */
  __I   uint32_t RESERVED0[(0xFF4-0x008-0x04)/4];
  __IO	uint32_t POWERDOWN;         /*!< (@ 0x40054FF4) Powerdown mode */
} LPC_RNG_Type;


// ------------------------------------------------------------------------------------------------
// -----                                  Serial GPIO (SGPIO)                                 -----
// ------------------------------------------------------------------------------------------------

typedef struct
{
  __IO	uint32_t OUT_MUX_CFG[16];   /*!< (@ 0x40101000) Pin output multiplexer configuration */
  __IO	uint32_t SGPIO_MUX_CFG[16]; /*!< (@ 0x40101040) SGPIO input multiplexer configuration */
  __IO	uint32_t SLICE_MUX_CFG[16]; /*!< (@ 0x40101080) Slice multiplexer configuration */
  __IO	uint32_t REG[16];           /*!< (@ 0x401010C0) Register */
  __IO	uint32_t REG_SS[16];        /*!< (@ 0x40101100) Shadow register */
  __IO	uint32_t PRESET[16];        /*!< (@ 0x40101140) Reload value of  COUNT0, loaded when COUNT0 reaches 0x0 */
  __IO	uint32_t COUNT[16];         /*!< (@ 0x40101180) Down counter, counts down each clock cycle */
  __IO	uint32_t POS[16];           /*!< (@ 0x401011C0) Each time COUNT0 reaches 0x0 POS counts down */
  __IO	uint32_t MASK_A;            /*!< (@ 0x40101200) Mask for pattern match function of slice A */
  __IO	uint32_t MASK_H;            /*!< (@ 0x40101204) Mask for pattern match function of slice H */
  __IO	uint32_t MASK_I;            /*!< (@ 0x40101208) Mask for pattern match function of slice I */
  __IO	uint32_t MASK_P;            /*!< (@ 0x4010120C) Mask for pattern match function of slice P */
  __I	uint32_t GPIO_INREG;        /*!< (@ 0x40101210) GPIO input status register */
  __IO	uint32_t GPIO_OUTREG;       /*!< (@ 0x40101214) GPIO output control register */
  __IO	uint32_t GPIO_OEREG;        /*!< (@ 0x40101218) GPIO OE control register */
  __IO	uint32_t CTRL_ENABLE;       /*!< (@ 0x4010121C) Enables the slice COUNT counter */
  __IO	uint32_t CTRL_DISABLE;      /*!< (@ 0x40101220) Disables the slice COUNT counter */
  __I   uint32_t RESERVED0[(0xF00-0x220-0x04)/4];
  __IO	uint32_t CLR_EN0;           /*!< (@ 0x40101F00) Shift clock interrupt clear mask */
  __IO	uint32_t SET_EN0;           /*!< (@ 0x40101F04) Shift clock interrupt set mask */
  __I	uint32_t ENABLE0;           /*!< (@ 0x40101F08) Shift clock interrupt enable */
  __I	uint32_t STATUS0;           /*!< (@ 0x40101F0C) Shift clock interrupt status */
  __IO	uint32_t CTR_STAT0;         /*!< (@ 0x40101F10) Shift clock interrupt clear status */
  __IO	uint32_t SET_STAT0;         /*!< (@ 0x40101F14) Shift clock interrupt set status */
  __I   uint32_t RESERVED1[2];
  __IO	uint32_t CLR_EN1;           /*!< (@ 0x40101F20) Capture clock interrupt clear mask */
  __IO	uint32_t SET_EN1;           /*!< (@ 0x40101F24) Capture clock interrupt set mask */
  __I	uint32_t ENABLE1;           /*!< (@ 0x40101F28) Capture clock interrupt enable */
  __I	uint32_t STATUS1;           /*!< (@ 0x40101F2C) Capture clock interrupt status */
  __IO	uint32_t CTR_STAT1;         /*!< (@ 0x40101F30) Capture clock interrupt clear status */
  __IO	uint32_t SET_STAT1;         /*!< (@ 0x40101F34) Capture clock interrupt set status */
  __I   uint32_t RESERVED2[2];
  __IO	uint32_t CLR_EN2;           /*!< (@ 0x40101F40) Pattern match interrupt clear mask */
  __IO	uint32_t SET_EN2;           /*!< (@ 0x40101F44) Pattern match interrupt set mask */
  __I	uint32_t ENABLE2;           /*!< (@ 0x40101F48) Pattern match interrupt enable */
  __I	uint32_t STATUS2;           /*!< (@ 0x40101F4C) Pattern match interrupt status */
  __IO	uint32_t CTR_STAT2;         /*!< (@ 0x40101F50) Pattern match interrupt clear status */
  __IO	uint32_t SET_STAT2;         /*!< (@ 0x40101F54) Pattern match interrupt set status */
  __I   uint32_t RESERVED3[2];
  __IO	uint32_t CLR_EN3;           /*!< (@ 0x40101F60) Input interrupt clear mask */
  __IO	uint32_t SET_EN3;           /*!< (@ 0x40101F64) Input bit match interrupt set mask */
  __I	uint32_t ENABLE3;           /*!< (@ 0x40101F68) Input bit match interrupt enable */
  __I	uint32_t STATUS3;           /*!< (@ 0x40101F6C) Input bit match interrupt status */
  __IO	uint32_t CTR_STAT3;         /*!< (@ 0x40101F70) Input bit match interrupt clear status */
  __IO	uint32_t SET_STAT3;         /*!< (@ 0x40101F74) Input bit match interrupt set status */
} LPC_SGPIO_Type;

#if defined ( __CC_ARM   )
  #pragma no_anon_unions
#endif


// ------------------------------------------------------------------------------------------------
// -----                                 Peripheral memory map                                -----
// ------------------------------------------------------------------------------------------------

#define LPC_SCT_BASE              (0x40000000)
#define LPC_GPDMA_BASE            (0x40002000)
#define LPC_SPIFI_BASE            (0x40003000)
#define LPC_SDMMC_BASE            (0x40004000)
#define LPC_EMC_BASE              (0x40005000)
#define LPC_USB0_BASE             (0x40006000)
#define LPC_USB1_BASE             (0x40007000)
#define LPC_LCD_BASE              (0x40008000)
#define LPC_ETHERNET_BASE         (0x40010000)
#define LPC_ATIMER_BASE           (0x40040000)
#define LPC_REGFILE_BASE          (0x40041000)
#define LPC_PMC_BASE              (0x40042000)
#define LPC_CREG_BASE             (0x40043000)
#define LPC_EVENTROUTER_BASE      (0x40044000)
#define LPC_RTC_BASE              (0x40046000)
#define LPC_CGU_BASE              (0x40050000)
#define LPC_CCU1_BASE             (0x40051000)
#define LPC_CCU2_BASE             (0x40052000)
#define LPC_RGU_BASE              (0x40053000)
#define LPC_WWDT_BASE             (0x40080000)
#define LPC_USART0_BASE           (0x40081000)
#define LPC_USART2_BASE           (0x400C1000)
#define LPC_USART3_BASE           (0x400C2000)
#define LPC_UART1_BASE            (0x40082000)
#define LPC_SSP0_BASE             (0x40083000)
#define LPC_SSP1_BASE             (0x400C5000)
#define LPC_TIMER0_BASE           (0x40084000)
#define LPC_TIMER1_BASE           (0x40085000)
#define LPC_TIMER2_BASE           (0x400C3000)
#define LPC_TIMER3_BASE           (0x400C4000)
#define LPC_SCU_BASE              (0x40086000)
#define LPC_GPIO_PIN_INT_BASE     (0x40087000)
#define LPC_GPIO_GROUP_INT0_BASE  (0x40088000)
#define LPC_GPIO_GROUP_INT1_BASE  (0x40089000)
#define LPC_MCPWM_BASE            (0x400A0000)
#define LPC_I2C0_BASE             (0x400A1000)
#define LPC_I2C1_BASE             (0x400E0000)
#define LPC_I2S0_BASE             (0x400A2000)
#define LPC_I2S1_BASE             (0x400A3000)
#define LPC_C_CAN1_BASE           (0x400A4000)
#define LPC_RITIMER_BASE          (0x400C0000)
#define LPC_QEI_BASE              (0x400C6000)
#define LPC_GIMA_BASE             (0x400C7000)
#define LPC_DAC_BASE              (0x400E1000)
#define LPC_C_CAN0_BASE           (0x400E2000)
#define LPC_ADC0_BASE             (0x400E3000)
#define LPC_ADC1_BASE             (0x400E4000)
#define LPC_GPIO_PORT_BASE        (0x400F4000)
//The following are applied to have a backward compitability with existing Eagle/Raptor GPIOs
#define LPC_GPIO0_BASE            (0x400F4000)
#define LPC_GPIO1_BASE            (0x400F4004)
#define LPC_GPIO2_BASE            (0x400F4008)
#define LPC_GPIO3_BASE            (0x400F400C)
#define LPC_GPIO4_BASE            (0x400F4010)
#define LPC_GPIO5_BASE            (0x400F4014)
#define LPC_GPIO6_BASE            (0x400F4018)
#define LPC_GPIO7_BASE            (0x400F401C)
#define LPC_RNG_BASE              (0x40054000)
#define LPC_SGPIO_BASE            (0x40101000)
#define LPC_VADC_BASE             (0x400F0000)


// ------------------------------------------------------------------------------------------------
// -----                                Peripheral declaration                                -----
// ------------------------------------------------------------------------------------------------

#define LPC_SCT                   ((LPC_SCT_Type            *) LPC_SCT_BASE)
#define LPC_GPDMA                 ((LPC_GPDMA_Type          *) LPC_GPDMA_BASE)
#define LPC_SPIFI                 ((LPC_SPIFI_Type          *) LPC_SPIFI_BASE)
#define LPC_SDMMC                 ((LPC_SDMMC_Type          *) LPC_SDMMC_BASE)
#define LPC_EMC                   ((LPC_EMC_Type            *) LPC_EMC_BASE)
#define LPC_USB0                  ((LPC_USB0_Type           *) LPC_USB0_BASE)
#define LPC_USB1                  ((LPC_USB1_Type           *) LPC_USB1_BASE)
#define LPC_LCD                   ((LPC_LCD_Type            *) LPC_LCD_BASE)
#define LPC_ETHERNET              ((LPC_ETHERNET_Type       *) LPC_ETHERNET_BASE)
#define LPC_ATIMER                ((LPC_ATIMER_Type         *) LPC_ATIMER_BASE)
#define LPC_REGFILE               ((LPC_REGFILE_Type        *) LPC_REGFILE_BASE)
#define LPC_PMC                   ((LPC_PMC_Type            *) LPC_PMC_BASE)
#define LPC_CREG                  ((LPC_CREG_Type           *) LPC_CREG_BASE)
#define LPC_EVENTROUTER           ((LPC_EVENTROUTER_Type    *) LPC_EVENTROUTER_BASE)
#define LPC_RTC                   ((LPC_RTC_Type            *) LPC_RTC_BASE)
#define LPC_CGU                   ((LPC_CGU_Type            *) LPC_CGU_BASE)
#define LPC_CCU1                  ((LPC_CCU1_Type           *) LPC_CCU1_BASE)
#define LPC_CCU2                  ((LPC_CCU2_Type           *) LPC_CCU2_BASE)
#define LPC_RGU                   ((LPC_RGU_Type            *) LPC_RGU_BASE)
#define LPC_WWDT                  ((LPC_WWDT_Type           *) LPC_WWDT_BASE)
#define LPC_USART0                ((LPC_USARTn_Type         *) LPC_USART0_BASE)
#define LPC_USART2                ((LPC_USARTn_Type         *) LPC_USART2_BASE)
#define LPC_USART3                ((LPC_USARTn_Type         *) LPC_USART3_BASE)
#define LPC_UART1                 ((LPC_UART1_Type          *) LPC_UART1_BASE)
#define LPC_SSP0                  ((LPC_SSPn_Type           *) LPC_SSP0_BASE)
#define LPC_SSP1                  ((LPC_SSPn_Type           *) LPC_SSP1_BASE)
#define LPC_TIMER0                ((LPC_TIMERn_Type         *) LPC_TIMER0_BASE)
#define LPC_TIMER1                ((LPC_TIMERn_Type         *) LPC_TIMER1_BASE)
#define LPC_TIMER2                ((LPC_TIMERn_Type         *) LPC_TIMER2_BASE)
#define LPC_TIMER3                ((LPC_TIMERn_Type         *) LPC_TIMER3_BASE)
#define LPC_SCU                   ((LPC_SCU_Type            *) LPC_SCU_BASE)
#define LPC_GPIO_PIN_INT          ((LPC_GPIO_PIN_INT_Type   *) LPC_GPIO_PIN_INT_BASE)
#define LPC_GPIO_GROUP_INT0       ((LPC_GPIO_GROUP_INT0_Type*) LPC_GPIO_GROUP_INT0_BASE)
#define LPC_GPIO_GROUP_INT1       ((LPC_GPIO_GROUP_INT1_Type*) LPC_GPIO_GROUP_INT1_BASE)
#define LPC_MCPWM                 ((LPC_MCPWM_Type          *) LPC_MCPWM_BASE)
#define LPC_I2C0                  ((LPC_I2Cn_Type           *) LPC_I2C0_BASE)
#define LPC_I2C1                  ((LPC_I2Cn_Type           *) LPC_I2C1_BASE)
#define LPC_I2S0                  ((LPC_I2Sn_Type           *) LPC_I2S0_BASE)
#define LPC_I2S1                  ((LPC_I2Sn_Type           *) LPC_I2S1_BASE)
#define LPC_C_CAN1                ((LPC_C_CANn_Type         *) LPC_C_CAN1_BASE)
#define LPC_RITIMER               ((LPC_RITIMER_Type        *) LPC_RITIMER_BASE)
#define LPC_QEI                   ((LPC_QEI_Type            *) LPC_QEI_BASE)
#define LPC_GIMA                  ((LPC_GIMA_Type           *) LPC_GIMA_BASE)
#define LPC_DAC                   ((LPC_DAC_Type            *) LPC_DAC_BASE)
#define LPC_C_CAN0                ((LPC_C_CANn_Type         *) LPC_C_CAN0_BASE)
#define LPC_ADC0                  ((LPC_ADCn_Type           *) LPC_ADC0_BASE)
#define LPC_ADC1                  ((LPC_ADCn_Type           *) LPC_ADC1_BASE)
#define LPC_GPIO_PORT             ((LPC_GPIO_PORT_Type      *) LPC_GPIO_PORT_BASE)
#define LPC_GPIO0                 ((LPC_GPIOn_Type          *) LPC_GPIO0_BASE)     //Backward compitable for all GPIOs
#define LPC_GPIO1                 ((LPC_GPIOn_Type          *) LPC_GPIO1_BASE)
#define LPC_GPIO2                 ((LPC_GPIOn_Type          *) LPC_GPIO2_BASE)
#define LPC_GPIO3                 ((LPC_GPIOn_Type          *) LPC_GPIO3_BASE)
#define LPC_GPIO4                 ((LPC_GPIOn_Type          *) LPC_GPIO4_BASE)
#define LPC_GPIO5                 ((LPC_GPIOn_Type          *) LPC_GPIO5_BASE)
#define LPC_GPIO6                 ((LPC_GPIOn_Type          *) LPC_GPIO6_BASE)
#define LPC_GPIO7                 ((LPC_GPIOn_Type          *) LPC_GPIO7_BASE)
#define LPC_SGPIO                 ((LPC_SGPIO_Type          *) LPC_SGPIO_BASE)
#define LPC_RNG                   ((LPC_RNG_Type            *) LPC_RNG_BASE)
#define LPC_VADC                  ((LPC_VADC_Type           *) LPC_VADC_BASE)

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group (null) */
/** @} */ /* End of group LPC18xx_43xx */

#ifdef __cplusplus
}
#endif 


#endif  // __LPC18XX_43XX_H__
